Revit 2024 API
Rebar.CanBeMatchedWithMultipleShapes Method
 Checks if this Rebar can be matched with multiple Rebar Shapes.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public bool CanBeMatchedWithMultipleShapes()
Visual Basic
Public Function CanBeMatchedWithMultipleShapes As Boolean
Visual C++
public:
bool CanBeMatchedWithMultipleShapes()
Return Value
 Returns true if this Rebar can be matched with multiple Rebar Shapes, false otherwise.
Remarks
 A Free Form Rebar that has Workshop Instructions set to Bent is considered that can be matched with multiple shapes.
 A Free Form Rebar that has Workshop Instructions set to Straight or a Shape Driven Rebar is considered that can be matched with only one shape.
See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace